{
  "nav": {
    "home": "Home",
    "experience": "Experience",
    "projects": "Projects",
    "certifications": "Certifications",
    "technologies": "Technologies",
    "blog": "Blog"
  },
  "aboutMe": {
    "greeting": "Hi, I'm",
    "name": "Alejo Suárez",
    "role": "Full Stack Developer",
    "description": {
      "part1": "with experience building web and mobile applications. I mainly work with",
      "highlight1": "Node.js",
      "highlight2": "React",
      "connector": "and multiple",
      "highlight3": "dependencies and third-party integrations",
      "part2": "focusing on code quality, performance, and user experience."
    },
    "contact": "Contact Me",
    "download": "Download CV"
  },
  "experience": {
    "title": "Work Experience",
    "freelance": {
      "title": "Freelance Developer",
      "subtitle": "Self-employed",
      "date": "March 2024 - Present",
      "text": "As a freelance developer, I specialize in designing and building web and mobile applications, delivering solutions aligned with each project's goals and requirements. I am committed to maintaining clear communication and a proactive approach throughout all development stages, ensuring high-quality results."
    },
    "developer": {
      "title": "Software Developer",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "May 2024 - Present",
      "text": "I am a Fullstack Developer with experience in optimizing applications to ensure better performance and a smoother user experience. I specialize in implementing new features and modules in existing systems, as well as developing applications from scratch, carefully managing every stage of the process—from analysis and design to implementation and deployment."
    },
    "analyst": {
      "title": "Functional Analyst",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "November 2023 - May 2024",
      "text": "Responsible for analyzing and determining requirements for software development projects. Focused on generating use cases and user stories, as well as creating various diagrams that comprised the analysis and design stages. In addition, I carried out QA testing tasks to guarantee the quality of the developed software."
    },
    "support": {
      "title": "Application Support",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "August 2022 - November 2023",
      "text": "My role consisted of identifying and resolving errors in university applications both from the administrator interface and through database queries when necessary. Additionally, I managed app permissions and kept in touch with users to help them resolve issues."
    }
  },
  "projects": {
    "web": "Web Projects",
    "mobile": "Mobile Projects",
    "samay": {
      "title": "Samay Wayra",
      "text": "Web page developed for a cabin rental company. It includes a photo gallery and a contact section to make accommodation reservations.",
      "url": null
    },
    "moviltrack": {
      "title": "Moviltrack",
      "text": "Integrated management application designed to optimize internal project and resource handling for companies. Centralizes information, generates reports, provides performance metrics, profitability analysis, and manages clients, suppliers, products, and projects. Features a role-based access system and dashboards for tracking metrics and overall business performance.",
      "url": null
    },
    "pap": {
      "title": "Paso a Paso",
      "text": "Web application developed for a wholesale company, enabling users to browse available products and add them to a cart for request purposes. Additionally, it includes an admin panel to manage products and configure general page settings.",
      "url": null
    },
    "traducciones": {
      "title": "SIA Translations",
      "text": "Microservice for a university portal, designed to translate and correct files. It manages the uploading and downloading of documents and includes specific roles for each user type. Additionally, it includes an email notification system to keep users informed.",
      "url": "https://sia.frba.utn.edu.ar/traducciones/solicitante"
    },
    "ripadmin": {
      "title": "RIP Admin",
      "text": "Web application for managing the 'RIP Alive' mobile app. It allows administrators to view user information, manage subscription and payment statuses, configure app catalogs, generate discount coupons, and more.",
      "url": null
    },
    "ripalive": {
      "title": "RIP Alive",
      "text": "Mobile application designed to allow users to save all their important information in case of death, to inform family members of their final wishes. Users can store details about what to do with their belongings, key contacts, investments, personal and health information, and more. The app includes a built-in subscription system and a store for purchasing products.",
      "url": "https://ripalive.com/"
    },
    "credential": {
      "title": "Credencial UTN",
      "text": "Mobile application designed as a digital credential for a university. It allows students to verify their enrollment status with a QR code and provides access to useful information, such as current courses, academic records, and a detailed schedule with class times. It also includes a section to download an enrollment certificate.",
      "url": null
    },
    "difusiones": {
      "title": "Broadcast System",
      "text": "Mass email delivery system developed for the National Technological University, used by all areas of the institution. It enables message segmentation through area-specific aliases, allowing targeted communication delivery. The system includes delivery tracking features and the creation and management of recipient lists, streamlining and optimizing institutional communication processes.",
      "url": "https://sia.frba.utn.edu.ar/difusiones"
    },
    "siaFrontend": {
      "title": "SIA Frontend",
      "text": "The SIA (Integrated Applications System) Frontend connects the systems of the Faculty of Technology of Buenos Aires, providing a centralized interface for students, faculty, and staff. Built with modern technologies like React and Material UI, it ensures efficient navigation, accessibility, and cross-device compatibility, integrating academic and administrative processes into a single platform.",
      "url": "https://sia.frba.utn.edu.ar/"
    }
  },
  "certifications": {
    "title": "Certifications",
    "fullstack": {
      "title": "Full Stack with React Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "May 2023"
    },
    "esi": {
      "title": "IT Security Expert",
      "place": "Universidad Tecnológica Nacional",
      "date": "Sep 2023"
    },
    "dbd": {
      "title": "Database Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "Oct 2023"
    },
    "python": {
      "title": "Python Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "Feb 2024"
    },
    "bootcamp": {
      "title": "Bootcamp UTN Credential",
      "place": "Universidad Tecnológica Nacional",
      "date": "Mar 2024"
    },
    "ddk": {
      "title": "Docker and Kubernetes",
      "place": "Universidad Tecnológica Nacional",
      "date": "Jul 2025"
    },
    "dbe": {
      "title": "Backend Developer Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "Sep 2025"
    },
    "dia": {
      "title": "Artificial Intelligence Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "Dec 2025"
    }
  },
  "stack": {
    "title": "Technology Stack",
    "subtitle": {
      "1": "Frontend",
      "2": "Backend",
      "3": "Tools",
      "4": "Learning"
    }
  },
  "blog": {
    "title": "Blog",
    "verTodos": "View all",
    "boton": "Read article"
  },
  "footer": {
    "title": "Developed by Alejo Suarez"
  }
}