{
  "nav": {
    "home": "Inicio",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "certifications": "Certificaciones",
    "technologies": "Tecnologías",
    "blog": "Blog"
  },
  "aboutMe": {
    "greeting": "Hola, soy",
    "name": "Alejo Suárez",
    "role": "Desarrollador Full Stack",
    "description": {
      "part1": "con experiencia en el desarrollo de aplicaciones web y móviles. Trabajo principalmente con",
      "highlight1": "Node.js",
      "highlight2": "React",
      "connector": "y múltiples",
      "highlight3": "dependencias e integraciones",
      "part2": "del entorno poniendo foco en la calidad, el rendimiento y la experiencia del usuario."
    },
    "contact": "Contactar",
    "download": "Descargar CV"
  },
  "experience": {
    "title": "Experiencia Laboral",
    "freelance": {
      "title": "Desarrollador Freelance",
      "subtitle": "Autónomo",
      "date": "Marzo 2024 - Actualidad",
      "text": "Como desarrollador freelance, me especializo en diseñar y desarrollar aplicaciones web y móviles, entregando soluciones alineadas con los objetivos y necesidades de cada proyecto. Me comprometo a mantener una comunicación clara y un enfoque proactivo durante todas las etapas del desarrollo, garantizando resultados de calidad."
    },
    "developer": {
      "title": "Desarrollador de Software",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "Mayo 2024 - Actualidad",
      "text": "Soy desarrollador Fullstack con experiencia en la optimización de aplicaciones, asegurando un mejor rendimiento y una experiencia de usuario más fluida. Me especializo en implementar nuevas funcionalidades y módulos en sistemas existentes, así como en el desarrollo de aplicaciones desde cero, cuidando cada etapa del proceso: desde el análisis y diseño hasta la implementación y despliegue."
    },
    "analyst": {
      "title": "Analista Funcional",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "Noviembre 2023 - Mayo 2024",
      "text": "Encargado del análisis y relevamiento de requisitos para proyectos de desarrollo de software. Enfocado en la generación de casos de uso e historias de usuario, así como en la creación de diversos diagramas que conformaban las etapas de análisis y diseño. Además, realizaba tareas de testing QA para garantizar la calidad del software desarrollado."
    },
    "support": {
      "title": "Soporte Aplicaciones",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "Agosto 2022 - Noviembre 2023",
      "text": "Mi rol consistía en identificar y resolver errores en las aplicaciones universitarias tanto desde la interfaz de administrador como mediante consultas en las bases de datos en caso de ser necesario. Además, gestionaba los permisos de las aplicaciones y mantenía contacto con los usuarios para asistirlos en la resolución de problemas."
    }
  },
  "projects": {
    "web": "Proyectos Web",
    "mobile": "Proyectos Móviles",
    "samay": {
      "title": "Samay Wayra",
      "text": "Página web desarrollada para una empresa de alquiler de cabañas. Incluye una galería de fotos y una sección de contacto para realizar reservas de alojamiento.",
      "url": "x"
    },
    "moviltrack": {
      "title": "Moviltrack",
      "text": "Aplicación de gestión integral diseñada para optimizar la administración interna de proyectos y recursos empresariales. Centraliza información, genera reportes, ofrece métricas de rendimiento, análisis de rentabilidad y gestión de clientes, proveedores, productos y proyectos. Incluye un sistema de roles y paneles de control para supervisar métricas y el desempeño general de la empresa.",
      "url": "x"
    },
    "pap": {
      "title": "Paso a Paso",
      "text": "Aplicación web desarrollada para una empresa mayorista, permite visualizar los productos disponibles y añadirlos a un carrito para realizar consultas. Además, incluye un panel de administrador para gestionar productos y configurar aspectos generales de la página.",
      "url": "x"
    },
    "traducciones": {
      "title": "SIA Traducciones",
      "text": "Microservicio para un portal universitario, diseñado para traducir y corregir archivos. Gestiona la carga y descarga de documentos y cuenta con roles específicos para cada tipo de usuario. Además, incluye un sistema de notificación por correo electrónico para mantener a los usuarios informados.",
      "url": "https://sia.frba.utn.edu.ar/traducciones/solicitante"
    },
    "ripadmin": {
      "title": "RIP Admin",
      "text": "Aplicación web para la administración de la aplicación móvil 'RIP Alive'. Permite a los administradores visualizar la información de los usuarios, gestionar el estado de las suscripciones y pagos, configurar catálogos de la aplicación, generar cupones de descuento, entre otras funcionalidades.",
      "url": "x"
    },
    "ripalive": {
      "title": "RIP Alive",
      "text": "Aplicación móvil diseñada para permitir a los usuarios guardar su información importante en caso de fallecimiento, con el fin de informar a sus familiares sobre sus últimos deseos. Los usuarios pueden almacenar detalles sobre qué hacer con sus pertenencias, contactos clave, inversiones, información personal y de salud, entre otros. La app cuenta con un sistema de suscripción de pago y una tienda con productos.",
      "url": "https://ripalive.com/"
    },
    "credential": {
      "title": "Credencial UTN",
      "text": "Aplicación móvil diseñada como credencial digital para una universidad. Permite a los estudiantes validarse como alumnos mediante un código QR y facilita el acceso a información útil, como las materias en curso, el historial académico y una agenda detallada con los horarios de cada asignatura. También incluye una sección para descargar la constancia de alumno.",
      "url": "x"
    },
    "difusiones": {
      "title": "Sistema de Difusiones",
      "text": "Sistema de envío masivo de correos electrónicos desarrollado para la Universidad Tecnológica Nacional, consumido por todas las áreas de la institución. Permite la segmentación de difusiones mediante alias propios de cada área, facilitando el envío dirigido de comunicaciones. Incluye funcionalidades de seguimiento de envíos y la creación y gestión de listas de destinatarios, optimizando y agilizando los procesos de comunicación institucional.",
      "url": "https://sia.frba.utn.edu.ar/difusiones"
    },
    "siaFrontend": {
      "title": "SIA Frontend",
      "text": "El Frontend de SIA (Sistema Integrado de Aplicaciones) conecta los sistemas de la Facultad Tecnológica de Buenos Aires, ofreciendo una interfaz centralizada para estudiantes, docentes y administrativos. Desarrollado con tecnologías modernas como React y Material UI, el sistema garantiza navegación eficiente, accesibilidad y compatibilidad en múltiples dispositivos, integrando procesos académicos y administrativos en una sola plataforma.",
      "url": "https://sia.frba.utn.edu.ar/"
    }
  },
  "certifications": {
    "title": "Certificaciones",
    "fullstack": {
      "title": "Diplomatura Full Stack con React",
      "place": "Universidad Tecnológica Nacional",
      "date": "May 2023"
    },
    "esi": {
      "title": "Experto en Seguridad Informática",
      "place": "Universidad Tecnológica Nacional",
      "date": "Sep 2023"
    },
    "dbd": {
      "title": "Diplomatura Bases de Datos",
      "place": "Universidad Tecnológica Nacional",
      "date": "Oct 2023"
    },
    "react": {
      "title": "Desarrollo en React",
      "place": "Universidad Tecnológica Nacional",
      "date": "30 Nov 2023"
    },
    "python": {
      "title": "Diplomatura Python",
      "place": "Universidad Tecnológica Nacional",
      "date": "Feb 2024"
    },
    "bootcamp": {
      "title": "Bootcamp Credencial UTN",
      "place": "Universidad Tecnológica Nacional",
      "date": "Mar 2024"
    },
    "ddk": {
      "title": "Docker y Kubernetes",
      "place": "Universidad Tecnológica Nacional",
      "date": "Jul 2025"
    },
    "dbe": {
      "title": "Diplomatura en Backend Developer",
      "place": "Universidad Tecnológica Nacional",
      "date": "Sep 2025"
    },
    "dia": {
      "title": "Diplomatura en Inteligencia Artificial",
      "place": "Universidad Tecnológica Nacional",
      "date": "Dic 2025"
    }
  },
  "stack": {
    "title": "Stack Tecnológico",
    "subtitle": {
      "1": "Frontend",
      "2": "Backend",
      "3": "Herramientas",
      "4": "Aprendiendo"
    }
  },
  "blog": {
    "title": "Blog",
    "verTodos": "Ver todos",
    "boton": "Leer artículo"
  },
  "footer": {
    "title": "Desarrollado por Alejo Suarez"
  }
}